feat: draw the packages and the classes as UML
